kaunghtethtun/stm32_study/Firmware V-0.0/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void CAN_Error_Handler(void);



/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define E_STOP_Pin GPIO_PIN_0
#define E_STOP_GPIO_Port GPIOA
#define E_STOP_EXTI_IRQn EXTI0_IRQn
#define BATT_ADC_Pin GPIO_PIN_2
#define BATT_ADC_GPIO_Port GPIOA
#define MOTOR_UART2_RX_Pin GPIO_PIN_3
#define MOTOR_UART2_RX_GPIO_Port GPIOA
#define COMMUNICATION_UART3_TX_Pin GPIO_PIN_10
#define COMMUNICATION_UART3_TX_GPIO_Port GPIOB
#define COMMUNICATION_UART3_RX_Pin GPIO_PIN_11
#define COMMUNICATION_UART3_RX_GPIO_Port GPIOB
#define GREEN_LED_Pin GPIO_PIN_12
#define GREEN_LED_GPIO_Port GPIOD
#define ORANGE_LED_Pin GPIO_PIN_13
#define ORANGE_LED_GPIO_Port GPIOD
#define RED_LED_Pin GPIO_PIN_14
#define RED_LED_GPIO_Port GPIOD
#define BLUE_LED_Pin GPIO_PIN_15
#define BLUE_LED_GPIO_Port GPIOD
#define MOTOR_UART2_TX_Pin GPIO_PIN_5
#define MOTOR_UART2_TX_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
